[{"video_title": "How AI Could Empower Any Business | Andrew Ng | TED", "url": "https://www.youtube.com/watch?v=reUZRyXxUs4", "date": "10 months ago", "segments": [" When I think about the rise of AI, I'm reminded by the rise of literacy.", " A few hundred years ago, many people in society thought that maybe not everyone needed to be able to read and write.", " Back then, many people were attending views or herding sheep, so maybe there was less need for written communication.", " And all those needed was for the high priest and priestesses and monks to be able to read the Holy Book.", " And the rest of us could just go to the temple or church or the Holy Building and sit and listen to the high priest and priestesses' retours.", " Fortunately, with sense figured out that we can build a much racial society if lots of people can read and write.", " Today, AI is in the hands of the high priest and priestesses.", " These are the high-dees-go AI engineers, many of whom work in the big tech companies.", " And most people have access only to the AI that they build for them.", " I think that we can build a much racial society if we can enable everyone to help to write the future.", " But why is AI largely concentrated in the big tech companies?", " Because many of these AI projects have been expensive to build.", " They may require dozens of high-dees-go engineers and they may cost millions or tens of millions of dollars to build an AI system.", " And the large tech companies, particularly the ones with hundreds of millions or even billions of users,", " have been better than anyone else at making these investments pay off.", " Because for them, a one-size-fits-all AI system, such as one-day-approved Swiss search or that recommends", " but the products for online shopping can be applied to this very large number of users", " to generate a massive amount of revenue.", " But this recipe for AI does not work once you go outside to tech and internet sectors", " to other places where for the most part they're hardly any projects to apply to a hundred million people", " or they generate comparable economics.", " Let me illustrate an example.", " Many weekends, I drive a few minutes from my house to a local pizza store to buy a slice of Hawaiian pizza", " from the gentleman that owns his pizza store.", " And his pizza sprate, but he always has a lot of code pieces sitting around", " and every weekend some different flavor of pizza is all the stuff.", " But when I wash him, I pray his store, I get excited because by selling pizza, he is generating", " data and this is data that he can take advantage of if he had access to AI.", " AI systems are good as spotting patterns when given access to direct data and perhaps an AI system", " could spot if Mediterranean pizzas sell really well on a Friday night,", " maybe suggest to him to make more of it on a Friday afternoon.", " Now you might say to me, hey Andrew, this is a small pizza store, what's the big deal?", " And I say to the gentleman that owns this pizza store,", " something that can help him improve his revenues by a few thousand dollars a year", " that will be a huge deal to him.", " I know that there is a lot of hype about AI's need for massive data sets.", " And having more data does help, but contrary to the hype, AI can often work just fine even on", " models amounts of data such as the data generated by a single pizza store.", " So the real problem is not that there isn't enough data from the pizza store.", " The real problem is that the small pizza store could never serve enough customers to justify", " the cost of hiring an AI team.", " I know that in the United States there are about half a million independent restaurants", " and collectively these restaurants do serve tens of millions of customers,", " but every restaurant is different with different menu, different customers, different ways of", " recording sales that no one size fits all AI will work for all of them.", " What would it be like if we could enable small businesses and especially local businesses to use AI?", " Let's take a look at what it might look like at a complete that makes and sells t-shirts.", " I would love if in a context working for the t-shirt company can use AI for demand forecasting.", " Say figure out what funny means the print on t-shirts that would dry sales by looking at what's", " trending on social media or for product placement, why can't a front-to-store manager take pictures", " of what the store looks like and show it to an AI and have an AI recommend where to place products", " to improve sales. Supply chain can an AI recommend to buy or whether or not they should pay $20 per", " yard for a piece of fabric now or if they should keep looking because they might be the find", " a cheaper elsewhere or quality control, a quality inspector should be able to use AI to", " automatically scan pictures of the fabric they used to make t-shirts to check if there are", " any tears or discoloration in the cough. Today, large tech companies routinely use AI to solve problems", " like these and to create effect. But a typical t-shirt company or a typical automatic anecdote or", " retailer or school or local farm will be using AI for exactly zero of these applications today.", " Every t-shirt maker is sufficiently different from every other t-shirt maker that there is no one-size-fits-all", " AI that will work for all of them. And in fact, once you go outside the internet and tech sectors", " in other industries, even large companies such as the pharmaceutical companies, the chemicals,", " hospitals, also struggle with this. This is the long-tailed problem of AI. If you were to take", " all current and potential AI projects and sort them in decreasing order of value and plot them,", " you get drafted looks like this. Maybe the single most valuable AI system is something that decides", " what adds to show people on the internet. Maybe the second most valuable is a web search engine,", " maybe the third most valuable is a online shopping product recommendation system. But when you go to", " the right to this curve, you then get projects like t-shirt product placements or t-shirt demand forecasting", " or p-serer demand forecasting. And each of these is a unique project that needs to be custom built.", " Even t-shirt demand forecasting, it depends on trending memes on social media,", " it's a very different project than p-serer demand forecasting if that depends on the p-serer sales", " data. So today, there are millions of projects sitting on the tail of the distribution that no one", " is working on but whose agricultural value is massive. So how can we enable small businesses and", " individuals to build the AI systems that matter to them? For most of the last few decades,", " if you want to build an AI system, this is what you have to do, you have to write pages and pages of code.", " And while I would love for everyone to learn to code and in fact, online education and also offline", " education are helping more people than ever learn to code. Unfortunately, not everyone has the time", " to do this. But there is an emerging new way to build AI systems that will let more people participate.", " Just as pen and paper, which are a vastly superior technology to stones have their", " and chisel, were instrumental to widespread literacy, there are emerging new AI development platforms", " that shift the focus from asking you to write loss of code to asking you to focus on providing data", " and just turns out to be much easier for a lot of people to do. Today, there are multiple", " companies working on platforms like these. Let me illustrate a few of the concepts using one that my", " team has been building. Take the example of an inspector wanting AI to help detect defects in fabric.", " An inspector can take pictures of the fabric and upload it to platform like this and they can go in", " to show the AI what the errors in the fabric looks like by drawing rectangles. And they can also go in", " to show the AI what discolorations in the fabric looks like by drawing rectangles.", " So these pictures together with the green and pink rectangles that the inspector's drawn", " are data created by the inspector to explain to AI how to find tears and discolorations.", " After the AI examines this data, we may find that there has seen enough pictures of", " the parents but not yet in our pictures of discolorations. This is akin to if a junior inspector", " had learned to rely on these spotteras but still needs to further hold the judgment about", " discolorations. So the inspector can go back and take more pictures of discolorations to show", " to the AI to help it deepen his understanding. By adjusting the data you give to the AI,", " you can hope the AI gets smarter. So an inspector using an accessible platform like this can", " in a few hours to a few days and with purchasing a suitable camera set up,", " be able to build a custom AI system to detect defects, tears and discoloration in all the fabric", " being used to make t-shirts throughout the factory. And once again you may say, hey Andrew,", " this is one factory like why is this a big deal? And I say to you, this is a big deal to that inspector", " who's like this makes easier. And equally, this technology can empower a baker to use AI to check", " for the quality of the cakes that are making or a organic farmer to check the quality of the vegetables", " or a furniture maker to check the quality of the wood they're using.", " Flat phones like this will probably still need a few more years before they're easy enough to use", " for every pizzeria owner but many of these platforms are coming along and some of them are getting", " to be quite useful to someone that has tech savvy today with just a bit of training.", " But what this means is that rather than relying on the high-present pizzeria systems for everyone", " else, we can start to empower every accountants, every store manager, every buyer, and every", " whole team inspector to build their own AI systems. I hope that the pizzeria owner and many other small", " business owners like him will also take advantage of this technology because AI is creating", " tremendous wealth and will continue to create tremendous wealth. And it's only by democratizing", " access to AI that can ensure that this wealth is spread far and wide across society.", " Hundreds of years ago, I think hardly anyone understood the impact that widespread literacy will have.", " Today, I think hardly anyone understands the impact that democratizing access to AI will have.", " Building AI systems has been other reach for most people but that does not have to be the case.", " In the coming era for AI will empower everyone to build AI systems for themselves and I think that", " will be incredibly exciting future. Thank you very much."]}, {"video_title": "Exploring Artificial Intelligence’s Potential & Threats | Andrew Ng | Eye on AI #131", "url": "https://www.youtube.com/watch?v=OmwR5tuwWrU", "date": "4 weeks ago", "segments": [" do AI systems actually understand the world or are they some just called", " in stochastic Paris? I think AI systems do understand the world and they're also kind of getting", " better at explaining what they understand and what they don't understand. In fact,", " this is term stochastic Paris, this is just parroting words mimicking intelligence,", " but there was actually one study that really influenced my thinking called offelor gbt in which", " model was trained to predict the next move on a game of offelor. When we think about", " existential risks, I think there are existential risks to humanity. I think high on the list would be", " maybe the next pandemic, fingers crossed, or I think that global climate change is a risk", " to a society a large fraction of humanity. What it has for it did to the dinosaurs. There was many", " tens of millions of years ago. So it's less original risk for it not going to happen in our", " lifetime so that who knows. A very likely happened in the lifetime setting. But to me, we look at", " the actual things that could be the extinction of the humanity. I think AI would be other submission.", " Hi, I'm Craig Smith and this is Ion AI. In this episode, I'm going to talk to Andrew", " M. a well-known researcher in pioneer in machine learning. Andrew has taught courses at Stanford", " and trained many of the AI luminaries working today. For a time, he was the chief scientist", " did by do China's AI giant and he co-founded Coursera the online education company. Currently,", " he has an MLops company called Landing AI which has a suite of tools to make it easy for businesses", " to build deploy and manage machine learning models. I wanted to talk to Andrew because he's", " on the optimist side of the so-called threat debate, arguing that AI does not pose an imminent", " threat to humanity and that there's plenty of time to work out safety protocols, guardrails,", " and international agreements to prevent catastrophe. Now, here is Andrew. To begin with, do you", " believe that AI poses an existential threat even in a long term?", " No, I don't. I'm trying to keep an open mind but I'm having a really hard time seeing", " how AI creates a, I know Jeff Hinton and Yasha Benjo have both spoken about the", " extension risk to humanity from AI. I spoke with both Yasha and Jeff and what had the deepest", " respect for them. I'm trying to follow the reasoning. I'm struggling myself to see how AI", " receives a fantastic technology making society much better off. I struggle to see how that creates", " any meaningful extension risk of humanity. Yeah. And just for people that haven't been following", " the debate but see the headlines, there's no evidence, no scientific evidence to support the notion", " that AI poses an existential threat. It's theory, speculation.", " Yeah. I feel like the two arguments about AI potentially causing an existential", " rescue humanity. The two arguments I heard is one is what if AI is so powerful, you know, not", " GP4, but GP2-25 or something, allows some really angry person or maybe someone that", " to create a bio-weapon that then causes humanity to go extinct. I think the risk of that seems", " small because it's actually pretty difficult to wipe out humanity no matter how angry one person", " may be. I do think that's a risk of meaningful harm. Some could create a weapon", " dreamy, but the extinction is a scale of risk that seems very unlikely, very implausible to me.", " The second argument that I've heard is sometimes it's called the paper, quite long", " argument, not to diminish it with that technology. But whether someone mis-specifies an AI objective,", " the other problem will come from the figures out the way to make a lot of money,", " accidentally wiped out humanity. I think of an AI smart enough to do that, it will probably", " smart enough to understand our intentions, so many people work on the AI safety.", " So AI smart enough to accidentally wipe us out will probably be smart enough to know if we", " said, make a lot of paperclips, we did not mean make a lot of paperclips and along the way", " it's fine to wipe our humanity, so that seems unlikely to me as well.", " Is there a way that lay people looking at this debate, indifferentiate between real risks and", " speculative fears? So I don't know, it's a good question, it's challenging. So AI just", " technology does have short-term homes today, the product-oriented cases of bias unfairness.", " We've seen that polyprogrammed self-driving health systems can lead to car accidents,", " these kinetic events that lead to human death right now. So if you like, there are those homes", " that AI researchers are working to address, one nice thing about large language models,", " like, CHIGPD, BOD, various models is I do see many researchers working to make them safer,", " so they're getting safer every month right now, so I feel good about that.", " You know, I sometimes think about the aviation industry. With the rise of aviation, airplanes", " were really dangerous, they crash, they kill people, completely tragic, no excuse for really airplane", " crashes. Having said that humanity, we learned from the airplane crashes and over time,", " aircraft got much safer. Today I think this fear about some aspects of AI because people say", " you can never control a large language model, and you know when else you can't control,", " you can't control an airplane either. You can't perfectly control where airplane points,", " because winds will blow the round. And sadly, even today, even in society today,", " there are occasional airplane crashes, which are very tragic, and these are really catastrophic", " loss of human life. Having said that, I think society seems much better off to me with airplanes", " than not. And even though we can't perfectly control an airplane, we can control them pretty well.", " So when I got in the airplane just a few days ago, I felt fine, you know, where I come", " on my laptop and not really wearing a other plane crash. And I think that we're on that trajectory", " as well, that large language models, even the last six months, have gotten much safer,", " much harder even for some of the delicious to make them do something bad. All right,", " it is still possible for some malicious and determined. But I think that over time,", " there is either accidental or malicious harm. It seems to be going down rapidly. And I don't think", " whatever the fully control them, but we can't fully control airplanes either. And if you're okay,", " getting on one inch and adjusting my life to one. Yeah, a couple of questions. One, this", " concern about AI centers really on intelligence, how intelligent AI systems", " are becoming. And and there's the debate that will you won't know when when AI reaches", " super intelligence because it won't necessarily tell you. Can we objectively measure the", " understanding of AI systems do you think? So this is debates about, you know, do AI systems", " actually understand the world or are they, um, some of this called the stochastic Paris?", " I think AI systems do understand the world. And they're also kind of getting better at explaining", " what they understand, what they don't understand. In fact, you know, this is term stochastic", " paradise. This is just parenting where us mimicking intelligence. But I, but there was actually", " one study that really influenced by thinking called offello GPT, in which a model was trained", " to predict the next move on a game of offello, the game of a Brazil offello. And the authors", " of this study, which is published in the Ikea conference, I think demonstrated that the way to", " predict the next move in this game is to actually build a world model, and specifically the", " office down that if you probe the state of the neural network of the being fed, you know, a set of", " moves. It seems to be learning an underlying representation of the status of the board. So it's not", " just mimicking surface level, parenting out what's the next move. It's actually figured out what", " the game of offello is. So different from the list of moves. It figures out what's the board,", " status of the board, and therefore what are the possible next moves. So to me, those are fascinating", " study, you know, small scales, just the game of offello. But that really convinced me that I think", " today's last language models, they are building a model of the world. And to me, I believe they do", " understand the world. And also, if even last language model says something, and you say no,", " you know, that isn't right, or you added that math wrong in step five. The fact they can say,", " you know, when I apologize, my error, I did make a miscalculation in step three, and now,", " but let me fix step three and this is my new math result for some math puzzle.", " Um, I think that analogy is between machines and humans are always dangerous, you know, because", " but I feel like I don't know that that's very different than how a child learning to solve math", " work problems for the first time, they interpreted it. Where, so I feel like the", " lot of language models are getting better explaining to us, you know, how they're seeing the", " worlds. And just like when, um, when my daughter explains to me how she's thinking about the", " math problem, I believe her, and you know, I think she's telling the truth. So I think when the", " last language model was telling us how's he's saying about the world? For the most part, I know", " it doesn't always tell me the truth, but I think the tells says something close enough to the truth,", " is it feels okay to believe that these some of the time when it says that's how a thinking of", " other problems. Yeah. Um, so on the threat, um, you know, like your, your conversation with Jeff", " sort of the, the takeaway was that the research community needs to come to some consensus about", " the level of the threat and how to counter the threat, because right now with the, uh, with the,", " with the divergent opinions or the split in the community, the public's confused and certainly", " policy makers regulators, uh, are confused. So how can the research community reach a consensus", " on the threat? Yeah, more conversations. I feel like I'm continuing to have conversations on", " with with very different views, including those actively were about extinction to those were about", " otherists, uh, also many people are just busy building valuable applications, um, but not just me.", " I think of everyone with community, communication, you know, polite constructive discussion. Um,", " I think that we can maybe slowly, probably you'll be slow than any of us want, um, gradually", " come to come to, never a range of views. You know, I remember our six, maybe 70 years ago, um,", " what the rise of deep learning, kind of the wave of deep learning was started maybe 10 years ago,", " um, a few individuals, including most notably, you know, Elon Musk built games, um, warned of some", " of the risk of AI. And I think there was a spirit of where we at that time that didn't, can't", " to be died out. I think we heard, I heard much less about that after a while. Um, I think Elon Musk said", " something like, with AI, we may be something to demon. I, I'm, I may be discussing him. But", " we're respectfully submit that in the last decade, was summoned a lot more angels than demons with", " AI. Um, I mean, not not to dismiss the harms, there have been harms, but net net AI's been", " massive as you the society. Um, and then, and so I think that wave of worries frankly,", " died out, uh, this new wave of worries with, um, buy in from prominent scientists with, you know,", " Jeff and Yasha talk about extinction risk. That was a surprise to me. But I think it would be,", " it'd be, it'd be worthwhile to keep having conversations to see where we end up with this as well.", " Um, I'm really trying to keep it open. Even though I, I think I said, I just don't get it. I don't", " see how AI go lead to human extinction. Yeah. You know, the, the, the lack of that consensus,", " does, does that, is that a danger in itself that that either regulators listen to the,", " the people who are press pressing the existential threat narrative and overregulate or though,", " or they listen to those who say, look, those threats are far, far in the future of they exist at", " all and underregulate. Yeah. So one of the things Jeff and Tinnon I said in that video that I posted", " on social media or Twitter and LinkedIn is, um, one of the reasons why climate scientists have been", " in effective force is because there are a line. Right. So there are economic interests to ignore", " climate science and, you know, let's have lots of, and then just keep on generating carbon emissions.", " But the fact that climate scientists are more or less, you know, unified, um, on the science of climate", " that's made in much harder for economic interests that would find it more convenient to just,", " you know, not be regulated to, to lobby regulators to ignore climate science. So I think while AI,", " while the AI community is slinted, it actually makes it unfortunately much easier for, you know,", " anyone with an agenda to lobby regulators to whichever argument is more convenient for the business.", " So the economic unified, then I think like climate scientists have, we collectively do a much better", " job, um, hoping regulators unleash AI to create all the value again while also mitigating against", " realistic risks. And just be clear, when we think about existential risks, I think there are", " existential risks you man, as you, I think high on the list would be, you know, maybe the next", " pandemic, fingers crossed, or I think that global climate change is a risk to", " certainly a large fraction of humanity. And, you know, what the asteroids, what it asteroid", " did to the dinosaurs, there was many tens of millions of years ago. So it's less original risk", " for a knockout happening in our lifetimes, but who knows, a very likely happened in the lifetimes,", " but to me, we look at the actual things that could be an extinction risk to humanity. I think AI", " would be part of the solution. So AI, I don't think the world responded that well to the", " last pandemic, but I think AI enabled Dr. Scott Reeh and monitoring of disease conditions.", " That seems important to me. As climate change becomes worse, I think AI enabled solutions to", " mitigation, to the smart grid, to accelerate the electrification of a society, or can to leave,", " I often think about climate geoengineering. Do we need solutions like using high altitude aerosol", " sprays to slow down cooling or to planet? Or if not doing it now, because it's a dangerous technology,", " so it leads to advance the science of climate geoengineering with AI enabled modeling the climate.", " So we bet to understand if this is even an option, we should seriously consider it.", " So if we look at the real extinction risk to human kind, at least the ones I could", " foresee more clarity, AI seems like an important piece of the solution. So I would say if you", " want humanity to survive and thrive for the next thousand years, I would rather make AI go faster", " out of this slower. I want to give a shout out to this episode's sponsor MasterWorks,", " an art investing platform that buys contemporary masters outright, works by Picasso and Vengsky and", " Warhol and others than qualify it with the SEC to offer it as an investment.", " Net proceeds from the sale are distributed to its investors. Last year, most investors lost money", " even with a diversified stock portfolio, and that's why some of the biggest money managers in the", " US have been looking outside the stock market for assets with low correlation to traditional investments,", " things like fine art. The opportunity was exclusive to professional investors until now.", " MasterWork makes it available to ordinary investors like me. Since the inception, they've sold", " over $45 million worth of artwork, and so far all of MasterWorks' exits have delivered", " positive net returns for their investors. Of course, historical returns are not a guarantee for", " future returns. I'm not a financial advisor, so do your own due diligence. There's always a risk of loss.", " MasterWorks has over 750,000 users, and their art offerings usually sell out within hours,", " which is why they've had to create a wait list. But I, on AI listeners, can skip the line and get priority", " access right now by signing up at www.masterworks.art-backslash.ionai.ai.ai.", " NAAI all run together. Take a low-consue, which you think. Yeah, yeah, I agree. I mean, that's an argument.", " I've given around the dinner table that the real existential threat is the confirmed existential", " threat is climate change, and AI can do a lot to help us adapt or communicate that. The fact,", " in fact, a few years ago, I think Yoshibinja and I were both authors on this, but they've", " been wronged. Rather, really nice survey paper on all the ways that on many of the ways", " that AI can play a role in climate change, so that paper, which I'm still really others.", " David Rolnik and others did all the work, but you're quite proud of having participated", " in that work to think through how AI and local climate change. Yeah, that was those foundational", " paper for climate change AI. I remember that. Yeah, there's a lot of concern on the threat side", " and not only the existential threat, but immediate harm about open-source AI systems", " and that allow people to build beyond the purview of regulators or corporate management and", " that sort of thing. I was surprised to find recently. I mean, I know you were quite a while ago,", " but you were at my due. I was surprised to find that there's a very robust open-source", " ecosystem growing up around large language models or large models in China. Do you think that open-source", " is a danger? And specifically on China, have you used any of the open-source", " stuff that they put on GitHub? Yeah, I think the open-source community is a global one.", " There's a lot of great work in the United States, there's a lot of great work in Europe,", " and there's also a lot of great work on the China. So what I'm seeing is that open-source work is a", " fantastic force that is giving access to a lot of people around the world to large language models.", " I remember when staple diffusion released their image generation model, the train model", " open-source in late 2022, I think. There were just a five-league reasonable fears of,", " wow, one of this is useful harm on open-source one, anyway, in January, images now,", " whether that goes really poorly. And yes indeed, it has to be acknowledged. There were some", " problematic use cases, but I would say compared to the harm from a handful of problematic use cases", " to the massive amount of innovation, where people incorporate the models into also as a creative", " video and image editing software, new UIs, I think the benefits vastly outweigh the harm.", " I'm not dismissing the harm at all. I think that the models do exhibit bias, you ask the", " generate people of certain professions, or in January, it's pictures of one gender, or narrow-range", " and ethnicity, those are real problems that we need to work to solve. And there's so the negative", " harmful use cases of, you know, deep fake imagery. Having said that, what we've seen so far is that", " releasing open-source seems to create much more benefit when, when way to gain the harms.", " So I'm nervous about proposals to require licensing of models, open-source models.", " This seems to be absolutely terrible idea of those types of innovation and lead to regulatory", " capture, where it's much easier for big tech companies to satisfy regulatory requirements,", " just concentrating power in large tech companies and just advancing academic research groups", " and small businesses that don't have time or resources at the UF already on their risk.", " Very few requirements that really are not in my opinion effective at protecting people.", " Yeah, you know, and I don't want to get off on a dog leg on China, but immediately after", " GPD 3 came out, there was a lot of talk in the press about how China's going to be left behind", " because their speech laws, their laws, the control speech, the risk restrict political speech", " will limit the efficacy of large language models. And I argued against that to a lot of people,", " because our, you know, open AI or or Microsoft or or Google's large language models,", " also have restrictions on speech. So I thought that was a spacious argument. Nonetheless,", " I was surprised to see open source thriving in China. Does that surprise you at all just from", " what you know of China? Gosh, I don't know. I don't, I can't see I'm an expert on that.", " But it has been fantastic to see open source models thriving all around the world.", " And it's been interesting how global the research community is. A few weeks ago, I was in Canada", " for CVPR, where you're speaking about landing AI's visual prompting technology,", " but it was nice to see researches from all around the world come together and just share ideas freely", " and collectively, right, work hard to advance the signs of AI, a computer vision that I conference,", " very, really, AI will probably. Well, actually, and I'm sorry, I've left this till the end,", " but can you tell us about the visual prompting developments that you've been pursuing at landing AI?", " Yeah, so I think the text prompting revolution, which I wish I've already seen through", " ChagyBD and BARD, and so on, is coming to vision. And so landing AI has been developing", " visual prompting technology to make it easy for anyone to build into toy computer vision applications.", " So maybe, yeah, I'm going to flash my neural license and get technical over a second. But", " in the text prompting revolution was really enabled by text transformers, right, the team", " I started and once like Google Brain published the text transformer paper in 2017, and since then,", " there's a wave of innovation by many, many research groups on scaling up text transformers and", " that led to GPD2, GPD3, you know, I don't know, mega-tron, sorry, many models along the way,", " on to record instructor, GPD and then ChagyBD and BARD and Bing chat and so on.", " Not many people know, but the vision transformer paper came out about three years later in 2020,", " and if you go to computer vision conferences, I think since 2020, there's been this wave of", " innovation and scaling up in the exploration of how they get vision transformers to understand images.", " And the underlying transfer of text and vision, but vision coming up later is these are models", " trained on very large amounts of data, text or images. The training is increasingly on", " unlabeled data, so this, you know, that's you have access to a lot more data or unlabeled", " technically self-supervision. And what was already seen in text is with pre-training a neural network", " on tons of unlabeled text data, you can feed the very simple text prompt and have it make", " inferences. What was starting to see in computer vision, which I think is like maybe a couple", " years, one in the half years two years behind text, is when you train a very large vision", " transformer on a lot of images on the internet, then you can give it a simple visual prompt and", " it have a start to make inferences in just seconds. So, let me, I, whatever these are take on visual", " prompting where anyone can go and use it, go use it for free to label a prompt it with a few,", " you know, label a few pixels in heaven, then or to ask me figure out what to do after that.", " And as a developer too, this is exciting because just as we've seen with text prompting,", " applications that used to take me, you know, six months to build, now anyone can build", " maybe a day. There applications used to take me six months to build in computer vision that,", " you know, with our tools, is now getting to be possible to build and maybe a day or a few days.", " So, the innovation is exciting, not just from my team landing AI, but from many groups,", " we're actually in the computer vision. Yeah, that's fascinating. And just on visual prompting", " large image models, if that's what they are, they're vectorizing the, an image", " by converting each line of pixels to a vector is that right?", " Yeah, patches of the image rather than it catches. Yeah, think of it, you know,", " it may tokenize that in the same way that for a sentence, you, you, you, you, it's convert that to an", " embedding, then you're, you're trying to predict the next token. Yeah, yeah, and just like", " all, yes. So I think in text based transform is, you know, the core task, sometimes called the pretext", " task is to predict the next word or technically predict the next token. So because text is at", " linear level there, predicting the next word, the next token, you know, is a nice way to use", " on the able data. One of the things, one of the reasons why there's so much buzz and exploration", " in computer vision is the process of taking an image and converting that to a sequence of tokens,", " there are a few different options for that. So, you know, do you, convert to the patches,", " do you hide or mask some patches along the way, but, but, so different researchers are exploring", " different ways to do that, but there, there's multiple ways to see them through working and that", " scaling up of vision transform is we're already seeing very exciting results. Right from that", " me, I, I, I, that met a Sam segment anything model was another exciting breakthrough, I'm just seeing", " actually when I was at CVPR, you know, earlier this year in 233, I felt that vision transform", " has become a solid alternative to convolutional neural networks and the buzz and innovation.", " I remember a couple years before chat GPT, in the NLP on the text processing community,", " everyone knew something was in the year about transform is. No one knew exactly what's going", " to happen, but everyone knew something, but people knew something was up and today,", " at CVPR, I feel like something's in the year, people know something is up, even though the exact", " applications the exact ways this will get used is the pin worked out. No, and, and your visual prompting", " the landing AI tool is specifically for, I mean, it's primary use cases for labeling images,", " is that right? Oh no, um, vision prompting is for building computer vision applications. So, for", " we've used this using it for cell counting, quite a lot of light signs as users, but, you know,", " given the picture of cells in the peak condition, in seconds you can build an application to", " detect the cells and then post-process it to count the number of cells. Or, I'll now, I've used it", " to handle some satellite imagery, where a lot of a geospatial error imagery application as well,", " easy one being, you know, finding tree cover, right? You can now do that in seconds. And then of", " course, a lot of land AI's users happen in manufacturing industrial automation, and so,", " for many of the manufacturing defect detection tasks, especially once based on texture,", " rather than shape, our visual prompting is the light people built into toy systems and seconds.", " But up in surprise also, even though I mentioned some of, you know, what we are seeing as", " a most common use cases in industrial manufacturing, life sizes and geospatial error imagery,", " I'm seeing a very long tail of applications as well, where many people, right, many of our users,", " are coming with also some applications computer vision that would not have imagined and now", " able to build and deploy them. For example, there was one group that was doing cosmology,", " you know, and since I'm not a astronomer, I would never have thought of doing that", " with a computer vision visual prompting application, so just to create a cavity once people have", " this too, this be well-loving. Just like I think when people have access to chat,", " GPT, you know, the creativity of things people did with it was incredible.", " We're definitely not yet there at the computer vision, but I think collectively,", " the few that's getting closer and closer. Yeah, at landing AI, how", " where do you, you personally, where are you on the spectrum between peer research and building", " applications? Landing AI focuses on applications. I mean, are you where are you in that spectrum?", " Oh, I think we're product company, but the product, the two, for building. So,", " let me, I provide software that makes computer vision easy, so the product landing lens makes", " that possible, but the product is backed by deep tech. We've been doing our own internal", " research on visual prompting for like, I don't know, you're in the half, maybe not quite", " two years, but so I think the, the way we approach the product is via deep tech. So even today,", " I spend a lot of my time worrying about the tech, how to improve visual prompting and improve", " the algorithms, as well as on the product, how to make it easier to use. That's it for this week's", " episode. I want to thank Andrew for his time. If you want to read a transcript of today's conversation", " you can find one on our website, Ion AI. That's EYE, hyphen, o and dot AI.", " In the meantime, remember, the singularity may not be near, but AI is about to change your world.", " So pay attention."]}]